app/controllers/admin/news_controller.rb

SELECT "news".* FROM "news" ORDER BY "news"."created_at" DESC
---
  def index
    @news = News.order(created_at: :desc)

SELECT "news".* FROM "news" WHERE "news"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def show
    @news = News.find(params[:id])

SELECT "categories".* FROM "categories"
---
  def new
    @news = News.new
    @categories = Category.all

INSERT INTO "news" ("title", "category_id", "source", "content", "created_at", "updated_at", "hidden") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    @news = News.new(news_params)
    if @news.save

SELECT "news".* FROM "news" WHERE "news"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
SELECT "categories".* FROM "categories"
---
  def edit
    # Find the news article to edit
    @news = News.find(params[:id])
    @categories = Category.all

SELECT "news".* FROM "news" WHERE "news"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
UPDATE "news" SET "category_id" = ?, "updated_at" = ? WHERE "news"."id" = ?  [["category_id", 4], ["updated_at", "2024-10-23 08:38:31.785084"], ["id", 8]]
---
  def update
    @news = News.find(params[:id])
    if @news.update(news_params)

SELECT "news".* FROM "news" WHERE "news"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
DELETE FROM "news" WHERE "news"."id" = ?  [["id", 14]]
---
  def destroy
    @news = News.find(params[:id])
    @news.destroy

UPDATE "news" SET "updated_at" = ?, "hidden" = ? WHERE "news"."id" = ?  [["updated_at", "2025-03-12 08:28:44.513393"], ["hidden", 1], ["id", 16]]
---
  def hide_unhide
    @news.update(hidden: params[:hide] == "true")

SELECT "news".* FROM "news" WHERE "news"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
---
  def set_news
    @news = News.find(params[:id])