app/controllers/comments_controller.rb

SELECT "news".* FROM "news" WHERE "news"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
INSERT INTO "comments" ("commenter", "body", "news_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["commenter", "Aloy"], ["body", "Very good new :)"], ["news_id", 16], ["created_at", "2025-03-12 08:06:42.025721"], ["updated_at", "2025-03-12 08:06:42.025721"]]
---
  def create #create a new comment
    @news = News.find(params[:news_id])
    @comment = @news.comments.create(comment_params)