app/controllers/news_controller.rb

  def home
    @news = News.all # search news table and store each row it finds in @news object.
    @news = News.order(created_at: :desc).limit(4) # Orders news by created_at in descending order and limit to 4 news
---
SELECT "news".* FROM "news" ORDER BY "news"."created_at" DESC LIMIT ?  [["LIMIT", 4]]

  def show # The method displays only further details on a single book.
    @news = News.find(params[:id])
---
SELECT "news".* FROM "news" WHERE "news"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]

  def new # The method lets Rails know that you will create a new object
    @news = News.new
    @categories = Category.all
---
SELECT "categories".* FROM "categories"

  def create # The method creates a record into the database
    @news = News.new(news_params)
    if @news.save
      redirect_to action: 'home'
    else
      @categories = Category.all
---
INSERT INTO "news" ("title", "category_id", "source", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"
SELECT "categories".* FROM "categories"

  def edit # The method looks nearly identical to the show method but EDITABLE
    @news = News.find(params[:id])
---
SELECT "news".* FROM "news" WHERE "news"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update # This method will be called after the edit method and update the changes into the database.
    @news = News.find(params[:id])
    if @news.update(news_params)
---
SELECT "news".* FROM "news" WHERE "news"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
UPDATE "news" SET "category_id" = ?, "source" = ?, "content" = ?, "updated_at" = ? WHERE "news"."id" = ?  [["category_id", 5], ["source", "SBS"], ["content", "Study Melbourne is a Victoria's government organisation."], ["updated_at", "2024-10-23 08:27:05.816784"], ["id", 8]]

  def show_categories
    @categories = Category.includes(:news).order(created_at: :desc) # Preload news for categories
---
SELECT "categories".* FROM "categories" ORDER BY "categories"."created_at" DESC
SELECT "news".* FROM "news" WHERE "news"."category_id" IN (?, ?, ?, ?, ?, ?)  [["category_id", 6], ["category_id", 5], ["category_id", 4], ["category_id", 3], ["category_id", 2], ["category_id", 1]]

  def search
    if params[:query].present?
      @news = News.where("content LIKE ?", "%#{params[:query]}%").order(created_at: :desc)
    else
      @news = News.order(created_at: :desc)
---
SELECT "news".* FROM "news" WHERE (content LIKE ?) ORDER BY "news"."created_at" DESC  [[nil, "%November%"]]
SELECT "news".* FROM "news" ORDER BY "news"."created_at" DESC